EDT/УТ/src/Catalogs/новаАдреса/новаАдреса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаАдреса</name>
  <attributes>
    <name>ВходитВКлассификатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.новаСтраны</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.новаРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Район</name>
    <type>
      <types>CatalogRef.новаРайоны</types>
    </type>
  </attributes>
  <attributes>
    <name>НаселенныйПункт</name>
    <type>
      <types>CatalogRef.новаНаселенныеПункты</types>
    </type>
  </attributes>
  <attributes>
    <name>Улица</name>
    <type>
      <types>CatalogRef.новаУлицы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корпус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Квартира</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИмеетКоординат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХэшКоординат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаИнтереса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТочкиИнтереса</name>
    <type>
      <types>CatalogRef.новаТипыТочекИнтереса</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТочкиИнтереса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособГеокодирования</name>
    <type>
      <types>EnumRef.СпособыГеокодирования</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/новаРайоныАдресов/новаРайоныАдресов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>новаРайоныАдресов</name>
  <dimensions>
    <name>Классификатор</name>
    <type>
      <types>CatalogRef.новаКлассификаторРайонов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Адрес</name>
    <type>
      <types>CatalogRef.новаАдреса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УказанВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Район</name>
    <type>
      <types>CatalogRef.новаГеоРайоны</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/новаАдреса/ObjectModule.bsl
//**** Вспомогательные функции ****//

// Автоматически формирует наименование по полям адреса.
//
Процедура СформироватьНаименование() Экспорт
	//+Степанов	Замена процедуры формирования адреса от нова на более читаемую.
	Если Не ТочкаИнтереса Тогда 
		Если СокрЛП(Регион) = СокрЛП(НаселенныйПункт) Тогда
			стрНП = СокрЛП(Регион);
		Иначе
			стрНП = СокрЛП(НаселенныйПункт) + ?(ЗначениеЗаполнено(Район), ", " + СокрЛП(Район), "")
			+ ", " + СокрЛП(Регион);
		КонецЕсли;
		
		Наименование = ""
		+ ?(не ТочкаИнтереса,
		Улица.НаименованиеПолное  
		+ ", " + Дом + ?(ПустаяСтрока(Корпус), "", " к " + Корпус)
		,
		?(ВРег(СокрЛП(НаселенныйПункт)) <> ВРег(СокрЛП(НаименованиеТочкиИнтереса)), ", " + НаименованиеТочкиИнтереса, ""))
		+ ", " + стрНП
		+ ?(Страна = Справочники.новаСтраны.Россия, "", ", " + СокрЛП(Страна));		
		Если Лев(Наименование, 2) = ", " Тогда
			Наименование = Сред(Наименование, 3);
		КонецЕсли;
	Иначе
		Наименование = "";
		НаименованиеСтрана = ?(Не ЗначениеЗаполнено(Страна) Или Страна = Справочники.новаСтраны.Россия,"",Страна.Наименование);
		НаименованиеРегион = СокрЛП(Регион);
		НаименованиеРайон  = СокрЛП(Район);
		НаименованиеНаселенныйПункт = СокрЛП(НаселенныйПункт);
		НаименованиеУлица = СокрЛП(Улица);
		
		Если НаименованиеРегион = НаименованиеНаселенныйПункт Тогда
			НаименованиеРегион = "";
		КонецЕсли;	
		Наименование = ?(ПустаяСтрока(НаименованиеСтрана),"",НаименованиеСтрана + ",") + ?(ПустаяСтрока(НаименованиеРегион),"",НаименованиеРегион + ",") 
		+ ?(ПустаяСтрока(НаименованиеРайон),"",НаименованиеРайон + ",") + ?(ПустаяСтрока(НаименованиеНаселенныйПункт),"",НаименованиеНаселенныйПункт + ",") 
		+ ?(ПустаяСтрока(НаименованиеУлица),"",НаименованиеУлица + ",")	+ ?(ПустаяСтрока(Дом),"","д." + Дом + ",")
		+ ?(ПустаяСтрока(Корпус),"","к." + Корпус + ",") + ?(ПустаяСтрока(Квартира),"","кв." + Квартира);
		Если СтрЗаканчиваетсяНа(Наименование,",") Тогда
			Код	= Лев(Наименование,СтрДлина(Наименование) - 1);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

//**** Обработчики событий объекта ****//

//Синхронизация с КСЛ, привязка георайонов
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//херим нова	
	//Попытка
	//	новаОбменКСЛ.СохранитьАдрес(ЭтотОбъект);
	//Исключение
	//	#Если Клиент Тогда			
	//		новаОбщиеПроцедуры.СообщитьПользователюОбОшибке("ВнутренняОшибкаСервера", ОписаниеОшибки());
	//	#КонецЕсли
	//	Отказ = Истина;
	//КонецПопытки;
	//херим нова
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//ЗаполнятьРайон = не (ДополнительныеСвойства.Свойство("ПакетнаяЗагрузка") и ДополнительныеСвойства.ПакетнаяЗагрузка);
	
	//Если ЗаполнятьРайон Тогда
	
	тзГеоРайоны = новаКарты.РассчитатьГеоРайоныАдресов(, Широта, Долгота);
	
	НаборЗаписей = РегистрыСведений.новаРайоныАдресов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Адрес.Установить(Ссылка);
	НаборЗаписей.Отбор.УказанВручную.Установить(Ложь);
	
	Для Каждого стрРайон Из тзГеоРайоны Цикл
		НаборЗаписей.Отбор.Классификатор.Установить(стрРайон.Классификатор);
		НаборЗаписей.Отбор.Район.Установить(стрРайон.Район);
		НаборЗаписей.Очистить();
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, стрРайон);
		Запись.Адрес = Ссылка;
		Запись.УказанВручную = Ложь;
		
		НаборЗаписей.Записать();
	КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры

//Синхронизация с КСЛ
//
Процедура ПередУдалением(Отказ)
	//херим нова	
	//Попытка
	//	новаОбменКСЛ.УдалитьАдрес(ЭтотОбъект);
	//Исключение
	//	#Если Клиент Тогда			
	//		новаОбщиеПроцедуры.СообщитьПользователюОбОшибке("ВнутренняОшибкаСервера", ОписаниеОшибки());
	//	#КонецЕсли
	//	Отказ = Истина;
	//КонецПопытки;
	//херим нова	
КонецПроцедуры

//Установка наименования
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ВходитВКлассификатор Тогда
		СформироватьНаименование();
	КонецЕсли;	
	
	ХэшКоординат = новаКарты.ПолучитьХэшКоординат(Широта, Долгота);
	
КонецПроцедуры
